A = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']


B = {
    'а': 0,
    'б': 1,
    'в': 2,
    'г': 3,
    'д': 4,
    'е': 5,
    'ё': 6,
    'ж': 7,
    'з': 8,
    'и': 9,
    'й': 10,
    'к': 11,
    'л': 12,
    'м': 13,
    'н': 14,
    'о': 15,
    'п': 16,
    'р': 17,
    'с': 18,
    'т': 19,
    'у': 20,
    'ф': 21,
    'х': 22,
    'ц': 23,
    'ч': 24,
    'ш': 25,
    'щ': 26,
    'ъ': 27,
    'ы': 28,
    'ь': 29,
    'э': 30,
    'ю': 31,
    'я': 32,
}


print("Введите текст")
p = str(input())
print("Введите ключ")
k = str(input())
for i in range(len(p)):
    if p[i] == ' ' or p[i]. isdigit() is True:
        print(p[i], end='')
    else:
        j = i
        while j >= len(k):
            j = j - len(k)
        t = k[j]
        n = B[p[i]] + B[t]
        if n < 32:
            print(A[B[p[i]] + B[t]], end='')
        else:
            print(A[B[p[i]] + B[t]-33], end='')
